---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStartLevelRamp
source: html/021ddd8a-bb55-e07b-9b04-6c231647351a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.InvalidStartLevelRamp Property

The start level and end level for this ramp must be at different elevations.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidStartLevelRamp { get; }
```